---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadComponent.#ctor(Autodesk.Revit.DB.ElementId,System.Double)
source: html/8676031f-0cc9-271b-c8c2-bdeb975c4cbf.htm
---
# Autodesk.Revit.DB.Structure.LoadComponent.#ctor Method

Constructs a new instance of a LoadComponent.
 The load case or combination id.
 The load case or combination factor.

## Syntax (C#)
```csharp
public LoadComponent(
	ElementId loadCaseOrCombinationId,
	double factor
)
```

## Parameters
- **loadCaseOrCombinationId** (`Autodesk.Revit.DB.ElementId`)
- **factor** (`System.Double`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null